# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, GhostConv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3Ghost, [128, True]]
  - [ -1, 1, SIMAM, [ 128 ] ] # new
  - [-1, 1, GhostConv, [256, 3, 2]] # 4-P3/8
  - [-1, 6, C3Ghost, [256, True]]
  - [ -1, 1, SIMAM, [ 256 ] ] # 6 # new
  - [-1, 1, GhostConv, [512, 3, 2]] # 7-P4/16
  - [-1, 6, C3Ghost, [512, True]]
  - [ -1, 1, SIMAM, [ 512 ] ] # 9 # new
  - [-1, 1, GhostConv, [1024, 3, 2]] # 10-P5/32
  - [-1, 3, C3Ghost, [1024, True]]
  - [ -1, 1, SIMAM, [ 1024 ] ] # 12 # new
  - [-1, 1, SPPF, [1024, 5]] # 13

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C3Ghost, [512]] # 16
  - [-1, 1, ECA, [ 512 ]] # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C3Ghost, [256]] # 20 (P3/8-small)
  - [-1, 1, ECA, [ 256 ]] # 21

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3Ghost, [512]] # 24 (P4/16-medium)
  - [-1, 1, ECA, [ 512 ]] # 25

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 3, C3Ghost, [1024]] # 28 (P5/32-large)
  - [-1, 1, ECA, [1024]] # 29

  - [[21, 25, 29], 1, Segment, [nc, 32, 256]]  # Detect(P3, P4, P5)
